app/controllers/distribution_data_carmillas_controller.rb

      # @data = csvData.scan(/\b\w+\b/)
    end

    @distribution_data_carmillas = DistributionDataCarmilla.all
---
SELECT "distribution_data_carmillas".* FROM "distribution_data_carmillas"