app/controllers/distribution_data_lovecrs_controller.rb

      # @data = csvData.scan(/\b\w+\b/)
    end

    @distribution_data_lovecr = DistributionDataLovecr.all
---
SELECT "distribution_data_lovecrs".* FROM "distribution_data_lovecrs"