app/controllers/texts_for_zipfs_controller.rb

  def index
    @texts_for_zipfs = TextsForZipf.all
---
SELECT "texts_for_zipfs".* FROM "texts_for_zipfs"

  def create
    @texts_for_zipf = TextsForZipf.new(texts_for_zipf_params)

    respond_to do |format|
      if @texts_for_zipf.save
---
INSERT INTO "texts_for_zipfs" ("text_name", "text_file", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    @texts_for_zipf.destroy
---
DELETE FROM "texts_for_zipfs" WHERE "texts_for_zipfs"."id" = ?  [["id", 1]]

    def set_texts_for_zipf
      @texts_for_zipf = TextsForZipf.find(params[:id])
---
SELECT "texts_for_zipfs".* FROM "texts_for_zipfs" WHERE "texts_for_zipfs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]